АлогистикТест2/src/DataProcessors/алк_ГрафическоеОтображениеКамерГТО/алк_ГрафическоеОтображениеКамерГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ГрафическоеОтображениеКамерГТО</name>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиКамерыГТО/алк_ОстаткиКамерыГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиКамерыГТО</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотр</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруГТО/алк_ЗагрузкаВКамеруГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруГТО</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <attributes>
    <name>ДатаНачалаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗагрузкиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПропарки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПропарки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПропаркиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Камера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыГТО/алк_ВыгрузкаИзКамерыГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамерыГТО</name>
  <basedOn>Document.алк_ЗагрузкаВКамеруГТО</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <attributes>
    <name>ДатаНачалаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузкиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеруГТО</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Камера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/алк_Участки/алк_Участки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_Участки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДополнительнаяОперация</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяАддендумы</name>
    <comment>Используются аддендумы, вместо ЗаказПокупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабочее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураВыпуска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСписания</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладВыпуска</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСписания</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДвиженияПроизводства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_ГрафическоеОтображениеКамерГТО/Forms/ФормаСмены/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСмены = ВозвратСменыИДатыСменыПоТекДате();
	Если ПараметрыСмены = NULL Тогда
		Сообщить("Не удалось автоматически определить текущую дату смены и смены, выберите параметры вручную!");
		Возврат;
	КонецЕсли;
	
	ДатаСмены = ПараметрыСмены.ДатаСмены;
	Смена = ПараметрыСмены.Смена; 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеФункции 

&НаСервереБезКонтекста
Функция ВозвратСменыИДатыСменыПоТекДате() 
	Возврат РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Справочники.алк_Участки.НайтиПоКоду("000000007"), ТекущаяДата());	
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьПериод(Смена, ДатаСмены)
	
	ДатаОкончания = алк_ОбщегоНазначенияКлиентСервер.ПолучитьВремяКонцаСмены(Смена, ДатаСмены);   
	ДатаНачала = ДатаСмены + (Смена.НачалоСмены - Дата(1,1,1)); 
	
	Период = Новый Структура;
	Период.Вставить("ДатаОкончания", ДатаОкончания);
	Период.Вставить("ДатаНачала", ДатаНачала);
	Возврат Период;

КонецФункции 

// Процедура формирования рапорта пропарки
Функция ЗаполнитьИВернутьТабличныйДокумент(ТабДок,ТекстОшибки)  					
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Рапорт"); 
	
	ВремяСмены = ПолучитьПериод(Смена,ДатаСмены);
	
	#Область ДанныеЗаполнения
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеРапортаЗаСмену();  
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Склад", Справочники.СтруктурныеЕдиницы.УчастокГТО); 
	Запрос.УстановитьПараметр("НаНачало", ВремяСмены.ДатаНачала); //начало смены
	Запрос.УстановитьПараметр("НаКонец", ВремяСмены.ДатаОкончания); //конец смены
	
	РезультатЗапроса = Запрос.ВыполнитьПакет(); 
	
	ДанныеШапка = РезультатЗапроса[4].Выгрузить(); 
	
	Если ДанныеШапка.Количество() = 0 Тогда 
		ТекстОшибки = "Не найдены данные за текущую смену, невозможно сформировать рапорт!";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДанныеШапка.Количество() > 1 Тогда
		ТекстОшибки = "Ошибка! За выбранную смену введены различающиеся реквизиты, невозможно сформировать рапорт, проверьте реквизиты ""Бригада"""
        + ", ""Участок"", ""Склад"", ""Организация"", ""Мастер"", ""Пропарщик"".";
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеТаблицы = РезультатЗапроса[5].Выгрузить();  
	#КонецОбласти
	
	#Область ОбластиМакета
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
	ОбластьИтогоТаблица = Макет.ПолучитьОбласть("ИтогоТаблица"); 
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	#КонецОбласти  
	
	#Область ОбластьШапка 
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ДанныеШапка[0]);  
	ОбластьШапка.Параметры.ДатаСмены = ДатаСмены; 
	ОбластьШапка.Параметры.Смена = Смена; 
	ТабДок.Вывести(ОбластьШапка);
	#КонецОбласти
	
	#Область ОбластьТаблица
	НомерСтроки = 1;
	Для Каждого стр ИЗ ДанныеТаблицы Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьТаблица.Параметры,стр);
		ОбластьТаблица.Параметры.НомерКамеры = НомерСтроки; 
		ТабДок.Вывести(ОбластьТаблица);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	#КонецОбласти
	
	#Область ОбластьИтогоТаблица
	ОстатокНаНачало = ДанныеТаблицы.Итог("ОстатокНаНачало"); 
	РазгрузкаОбъем = ДанныеТаблицы.Итог("РазгрузкаОбъем"); 
	ЗагрузкаОбъем = ДанныеТаблицы.Итог("ЗагрузкаОбъем");
	ОстатокНаКонец = ДанныеТаблицы.Итог("ОстатокНаКонец");
	
	ОбластьИтогоТаблица.Параметры.ИтогоНаНачало = ?(ОстатокНаНачало = 0,"",ОстатокНаНачало); 
	ОбластьИтогоТаблица.Параметры.ИтогоРазгрузка = ?(РазгрузкаОбъем = 0,"",РазгрузкаОбъем);
	ОбластьИтогоТаблица.Параметры.ИтогоЗагрузка = ?(ЗагрузкаОбъем = 0,"",ЗагрузкаОбъем);
	ОбластьИтогоТаблица.Параметры.ИтогоНаКонец = ?(ОстатокНаКонец = 0,"",ОстатокНаКонец);
	ТабДок.Вывести(ОбластьИтогоТаблица);
	#КонецОбласти
	
	#Область ОбластьПодвал 
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ДанныеШапка[0]);
	ТабДок.Вывести(ОбластьПодвал);
	#КонецОбласти   
	
	Возврат ТабДок;  
	
КонецФункции
					
&НаСервереБезКонтекста
Функция ТекстЗапросаДанныеРапортаЗаСмену()
	
	Возврат "ВЫБРАТЬ
	        |	ДанныеЗагрузки.Ссылка КАК Ссылка,
	        |	ДанныеЗагрузки.ДатаНачалаЗагрузки КАК ДатаНачалаЗагрузки,
	        |	ДанныеЗагрузки.ДатаОкончанияЗагрузки КАК ДатаОкончанияЗагрузки,
	        |	ДанныеЗагрузки.ДатаНачалаПропарки КАК ДатаНачалаПропарки,
	        |	ДанныеЗагрузки.ДатаОкончанияПропарки КАК ДатаОкончанияПропарки,
	        |	ДанныеЗагрузки.Бригада КАК Бригада,
	        |	ДанныеЗагрузки.Участок КАК Участок,
	        |	ДанныеЗагрузки.Склад КАК Склад,
	        |	ДанныеЗагрузки.Организация КАК Организация,
	        |	ДанныеЗагрузки.Камера КАК Камера,
	        |	ДанныеЗагрузки.Мастер КАК Мастер,
	        |	ДанныеЗагрузки.Пропарщик КАК Пропарщик,
	        |	алк_ЗагрузкаВКамеруГТОСостав.Длина КАК Длина,
	        |	алк_ЗагрузкаВКамеруГТОСостав.Порода КАК Порода,
	        |	алк_ЗагрузкаВКамеруГТОСостав.Сорт КАК Сорт,
	        |	алк_ЗагрузкаВКамеруГТОСостав.Градация КАК Градация,
	        |	алк_ЗагрузкаВКамеруГТОСостав.Объем КАК Объем
	        |ПОМЕСТИТЬ ВТ_ЗагрузкиЗаСмену
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		алк_ЗагрузкаВКамеруГТО.Ссылка КАК Ссылка,
	        |		алк_ЗагрузкаВКамеруГТО.ДатаНачалаЗагрузки КАК ДатаНачалаЗагрузки,
	        |		алк_ЗагрузкаВКамеруГТО.ДатаОкончанияЗагрузки КАК ДатаОкончанияЗагрузки,
	        |		алк_ЗагрузкаВКамеруГТО.ДатаНачалаПропарки КАК ДатаНачалаПропарки,
	        |		алк_ЗагрузкаВКамеруГТО.ДатаОкончанияПропарки КАК ДатаОкончанияПропарки,
	        |		алк_ЗагрузкаВКамеруГТО.Бригада КАК Бригада,
	        |		алк_ЗагрузкаВКамеруГТО.Участок КАК Участок,
	        |		алк_ЗагрузкаВКамеруГТО.Склад КАК Склад,
	        |		алк_ЗагрузкаВКамеруГТО.Организация КАК Организация,
	        |		алк_ЗагрузкаВКамеруГТО.Камера КАК Камера,
	        |		алк_ЗагрузкаВКамеруГТО.Мастер КАК Мастер,
	        |		алк_ЗагрузкаВКамеруГТО.Пропарщик КАК Пропарщик
	        |	ИЗ
	        |		Документ.алк_ЗагрузкаВКамеруГТО КАК алк_ЗагрузкаВКамеруГТО
	        |	ГДЕ
	        |		алк_ЗагрузкаВКамеруГТО.Проведен
	        |		И алк_ЗагрузкаВКамеруГТО.ДатаСмены = &ДатаСмены
	        |		И алк_ЗагрузкаВКамеруГТО.Смена = &Смена) КАК ДанныеЗагрузки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗагрузкаВКамеруГТО.Состав КАК алк_ЗагрузкаВКамеруГТОСостав
	        |		ПО ДанныеЗагрузки.Ссылка = алк_ЗагрузкаВКамеруГТОСостав.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеВыгрузки.Ссылка КАК Ссылка,
	        |	ДанныеВыгрузки.Бригада КАК Бригада,
	        |	ДанныеВыгрузки.Участок КАК Участок,
	        |	ДанныеВыгрузки.Склад КАК Склад,
	        |	ДанныеВыгрузки.Организация КАК Организация,
	        |	ДанныеВыгрузки.Камера КАК Камера,
	        |	ДанныеВыгрузки.Мастер КАК Мастер,
	        |	ДанныеВыгрузки.Пропарщик КАК Пропарщик,
	        |	ДанныеВыгрузки.ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	        |	ДанныеВыгрузки.ДатаОкончанияВыгрузки КАК ДатаОкончанияВыгрузки,
	        |	алк_ВыгрузкаИзКамерыГТОСостав.Длина КАК Длина,
	        |	алк_ВыгрузкаИзКамерыГТОСостав.Порода КАК Порода,
	        |	алк_ВыгрузкаИзКамерыГТОСостав.Сорт КАК Сорт,
	        |	алк_ВыгрузкаИзКамерыГТОСостав.Градация КАК Градация,
	        |	алк_ВыгрузкаИзКамерыГТОСостав.Объем КАК Объем
	        |ПОМЕСТИТЬ ВТ_ВыгрузкиЗаСмену
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		алк_ВыгрузкаИзКамерыГТО.Ссылка КАК Ссылка,
	        |		алк_ВыгрузкаИзКамерыГТО.Бригада КАК Бригада,
	        |		алк_ВыгрузкаИзКамерыГТО.Участок КАК Участок,
	        |		алк_ВыгрузкаИзКамерыГТО.Склад КАК Склад,
	        |		алк_ВыгрузкаИзКамерыГТО.Организация КАК Организация,
	        |		алк_ВыгрузкаИзКамерыГТО.Камера КАК Камера,
	        |		алк_ВыгрузкаИзКамерыГТО.Мастер КАК Мастер,
	        |		алк_ВыгрузкаИзКамерыГТО.Пропарщик КАК Пропарщик,
	        |		алк_ВыгрузкаИзКамерыГТО.ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	        |		алк_ВыгрузкаИзКамерыГТО.ДатаОкончанияВыгрузки КАК ДатаОкончанияВыгрузки
	        |	ИЗ
	        |		Документ.алк_ВыгрузкаИзКамерыГТО КАК алк_ВыгрузкаИзКамерыГТО
	        |	ГДЕ
	        |		алк_ВыгрузкаИзКамерыГТО.Проведен
	        |		И алк_ВыгрузкаИзКамерыГТО.ДатаСмены = &ДатаСмены
	        |		И алк_ВыгрузкаИзКамерыГТО.Смена = &Смена) КАК ДанныеВыгрузки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВыгрузкаИзКамерыГТО.Состав КАК алк_ВыгрузкаИзКамерыГТОСостав
	        |		ПО ДанныеВыгрузки.Ссылка = алк_ВыгрузкаИзКамерыГТОСостав.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	алк_ОстаткиКамерыГТООстатки.КамераПропарки КАК КамераПропарки,
	        |	алк_ОстаткиКамерыГТООстатки.КоличествоОстаток КАК КоличествоОстаток,
	        |	алк_ОстаткиКамерыГТООстатки.Порода КАК Порода,
	        |	алк_ОстаткиКамерыГТООстатки.Длина КАК Длина,
	        |	алк_ОстаткиКамерыГТООстатки.Сотр КАК Сотр,
	        |	алк_ОстаткиКамерыГТООстатки.Градация КАК Градация
	        |ПОМЕСТИТЬ ВТ_ОстаткиНаНачало
	        |ИЗ
	        |	РегистрНакопления.алк_ОстаткиКамерыГТО.Остатки(&НаНачало, ) КАК алк_ОстаткиКамерыГТООстатки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	алк_ОстаткиКамерыГТООстатки.КамераПропарки КАК КамераПропарки,
	        |	алк_ОстаткиКамерыГТООстатки.КоличествоОстаток КАК КоличествоОстаток,
	        |	алк_ОстаткиКамерыГТООстатки.Порода КАК Порода,
	        |	алк_ОстаткиКамерыГТООстатки.Длина КАК Длина,
	        |	алк_ОстаткиКамерыГТООстатки.Сотр КАК Сотр,
	        |	алк_ОстаткиКамерыГТООстатки.Градация КАК Градация
	        |ПОМЕСТИТЬ ВТ_ОстаткиНаКонец
	        |ИЗ
	        |	РегистрНакопления.алк_ОстаткиКамерыГТО.Остатки(&НаКонец, ) КАК алк_ОстаткиКамерыГТООстатки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеШапка.Бригада КАК Бригада,
	        |	ДанныеШапка.Участок КАК Участок,
	        |	ДанныеШапка.Склад КАК Склад,
	        |	ДанныеШапка.Организация КАК Организация,
	        |	ДанныеШапка.Мастер КАК Мастер,
	        |	ДанныеШапка.Пропарщик КАК Пропарщик
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВТ_ЗагрузкиЗаСмену.Бригада КАК Бригада,
	        |		ВТ_ЗагрузкиЗаСмену.Участок КАК Участок,
	        |		ВТ_ЗагрузкиЗаСмену.Склад КАК Склад,
	        |		ВТ_ЗагрузкиЗаСмену.Организация КАК Организация,
	        |		ВТ_ЗагрузкиЗаСмену.Мастер КАК Мастер,
	        |		ВТ_ЗагрузкиЗаСмену.Пропарщик КАК Пропарщик
	        |	ИЗ
	        |		ВТ_ЗагрузкиЗаСмену КАК ВТ_ЗагрузкиЗаСмену
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВТ_ЗагрузкиЗаСмену.Бригада,
	        |		ВТ_ЗагрузкиЗаСмену.Участок,
	        |		ВТ_ЗагрузкиЗаСмену.Склад,
	        |		ВТ_ЗагрузкиЗаСмену.Организация,
	        |		ВТ_ЗагрузкиЗаСмену.Мастер,
	        |		ВТ_ЗагрузкиЗаСмену.Пропарщик
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВТ_ВыгрузкиЗаСмену.Бригада,
	        |		ВТ_ВыгрузкиЗаСмену.Участок,
	        |		ВТ_ВыгрузкиЗаСмену.Склад,
	        |		ВТ_ВыгрузкиЗаСмену.Организация,
	        |		ВТ_ВыгрузкиЗаСмену.Мастер,
	        |		ВТ_ВыгрузкиЗаСмену.Пропарщик
	        |	ИЗ
	        |		ВТ_ВыгрузкиЗаСмену КАК ВТ_ВыгрузкиЗаСмену
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВТ_ВыгрузкиЗаСмену.Бригада,
	        |		ВТ_ВыгрузкиЗаСмену.Участок,
	        |		ВТ_ВыгрузкиЗаСмену.Склад,
	        |		ВТ_ВыгрузкиЗаСмену.Организация,
	        |		ВТ_ВыгрузкиЗаСмену.Мастер,
	        |		ВТ_ВыгрузкиЗаСмену.Пропарщик) КАК ДанныеШапка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеШапка.Бригада,
	        |	ДанныеШапка.Участок,
	        |	ДанныеШапка.Склад,
	        |	ДанныеШапка.Организация,
	        |	ДанныеШапка.Мастер,
	        |	ДанныеШапка.Пропарщик
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Камеры.Ссылка КАК Камера,
	        |	Камеры.Код КАК Код,
	        |	ВТ_ОстаткиНаНачало.Порода КАК ПородаНаНачало,
	        |	ВТ_ОстаткиНаНачало.Сотр КАК СортНаНачало,
	        |	ВТ_ОстаткиНаНачало.Длина КАК ДлинаНаНачало,
	        |	ВТ_ОстаткиНаНачало.Градация КАК ГрадацияНаНачало,
	        |	ЕСТЬNULL(ВТ_ОстаткиНаНачало.КоличествоОстаток, """") КАК ОстатокНаНачало,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ВыгрузкиЗаСмену.ДатаНачалаВыгрузки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ВыгрузкиЗаСмену.ДатаНачалаВыгрузки
	        |	КОНЕЦ КАК РазгрузкаНачало,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ВыгрузкиЗаСмену.ДатаОкончанияВыгрузки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ВыгрузкиЗаСмену.ДатаОкончанияВыгрузки
	        |	КОНЕЦ КАК РазгрузкаКонец,
	        |	ЕСТЬNULL(ВТ_ВыгрузкиЗаСмену.Объем, """") КАК РазгрузкаОбъем,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ЗагрузкиЗаСмену.ДатаНачалаЗагрузки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ЗагрузкиЗаСмену.ДатаНачалаЗагрузки
	        |	КОНЕЦ КАК ЗагрузкаНачало,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ЗагрузкиЗаСмену.ДатаОкончанияЗагрузки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ЗагрузкиЗаСмену.ДатаОкончанияЗагрузки
	        |	КОНЕЦ КАК ЗагрузкаКонец,
	        |	ЕСТЬNULL(ВТ_ЗагрузкиЗаСмену.Объем, """") КАК ЗагрузкаОбъем,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ЗагрузкиЗаСмену.ДатаНачалаПропарки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ЗагрузкиЗаСмену.ДатаНачалаПропарки
	        |	КОНЕЦ КАК ПропаркаНачало,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ЗагрузкиЗаСмену.ДатаОкончанияПропарки, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_ЗагрузкиЗаСмену.ДатаОкончанияПропарки
	        |	КОНЕЦ КАК ПропаркаКонец,
	        |	ВТ_ОстаткиНаКонец.Порода КАК ПородаНаКонец,
	        |	ВТ_ОстаткиНаКонец.Сотр КАК СортНаКонец,
	        |	ВТ_ОстаткиНаКонец.Длина КАК ДлинаНаКонец,
	        |	ВТ_ОстаткиНаКонец.Градация КАК ГрадацияНаКонец,
	        |	ЕСТЬNULL(ВТ_ОстаткиНаКонец.КоличествоОстаток, """") КАК ОстатокНаКонец
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		алк_Штабели.Ссылка КАК Ссылка,
	        |		алк_Штабели.Код КАК Код
	        |	ИЗ
	        |		Справочник.алк_Штабели КАК алк_Штабели
	        |	ГДЕ
	        |		алк_Штабели.Владелец = &Склад
	        |		И НЕ алк_Штабели.ПометкаУдаления) КАК Камеры
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаНачало КАК ВТ_ОстаткиНаНачало
	        |		ПО Камеры.Ссылка = ВТ_ОстаткиНаНачало.КамераПропарки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаКонец КАК ВТ_ОстаткиНаКонец
	        |		ПО Камеры.Ссылка = ВТ_ОстаткиНаКонец.КамераПропарки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗагрузкиЗаСмену КАК ВТ_ЗагрузкиЗаСмену
	        |		ПО Камеры.Ссылка = ВТ_ЗагрузкиЗаСмену.Камера
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыгрузкиЗаСмену КАК ВТ_ВыгрузкиЗаСмену
	        |		ПО Камеры.Ссылка = ВТ_ВыгрузкиЗаСмену.Камера
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Код";
	
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОК(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.ИмяПараметровПечати		= "ПАРАМЕТРЫ_ПЕЧАТИ_РапортПропарка";
	ТабличныйДокумент.АвтоМасштаб				= Истина;
	ТабличныйДокумент.РазмерКолонтитулаСверху	= 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу	= 0;
	ТабличныйДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	
	ТекстОшибки = "";
	
	Таб = ЗаполнитьИВернутьТабличныйДокумент(ТабличныйДокумент,ТекстОшибки);
	
	Если Таб = Неопределено Тогда 
		Закрыть(ТекстОшибки); 
		Возврат;
	КонецЕсли;  
	
	Закрыть();
	Таб.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры 

#КонецОбласти
